Revit 2027 API
FabricationConfiguration.LocateInsulationSpecification Method
 Gets the insulation specification by group and name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int LocateInsulationSpecification(
	string group,
	string name
)
Public Function LocateInsulationSpecification (
	group As String,
	name As String
) As Integer
public:
int LocateInsulationSpecification(
	String^ group,
	String^ name
)
member LocateInsulationSpecification :
        group : string *
        name : string -> int
Parameters
group String
 The insulation specification group.
name String
 The insulation specification name.
Return Value
Int32
 The insulation specification identifier. Returns -1 if not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace